In [1]:
print('귤', '사과', '배', sep='/') # separate

귤/사과/배

In [1]:
import sys
sys.version

'3.7.10 (default, Feb 26 2021, 13:06:18) [MSC v.1916 64 bit (AMD64)]'

In [ ]:
리스트 : 여러 개의 변수, 값을 묶어서 집합으로 관리하는 자료 형태,  [ ,]

In [ ]:
반복문

In [2]:
fruits = ['바나나', '사과', '딸기', '배', '감']
for fruit in fruits:
    print(fruit)

바나나
사과
딸기
배
감

In [ ]:
문자열 반복

In [3]:
z = '*'
print(z*10)

**********

In [ ]:
문자열 포매팅(1)

In [4]:
month = '2월'
day = '20일'
say = '{} {} 은 일요일입니다.'.format(month,day)
print(say)

2월 20일 은 일요일입니다.

In [5]:
print(f'{month} {day}은 일요입니다.')

2월 20일은 일요입니다.

In [ ]:
문자열 정리

In [8]:
t1 = '     hp010-0000-0000    '
print(t1)
t2 = t1.strip()
print(t2)
t3 = t2.replace('hp','')
print(t3)
t4 = t3.split('-')
print(t4)
print(f'{t4[0]} {t4[1]} {t4[2]}')

     hp010-0000-0000
hp010-0000-0000
010-0000-0000
['010', '0000', '0000']
010 0000 0000

In [ ]:
조건문

if 조건1:
    조건 1 만족 시 실행할 문장1
    
elif 조건2:
    조건 1은 불만족하지만 조건2 만족 시 실행할 문장2
else:
    모두 불만족 시 실행할 문장3

In [9]:
price = 5000
if price >3000:
    print('비싸다')
else:
    print('저렴하다')

비싸다

In [ ]:
함수
def 함수명(매개변수):
    실행부분

In [10]:
def say_name(name):
    print('안녕하세요')
    print(f'제 이름은 {name} 입니다.')
say_name('홍길동')

안녕하세요
제 이름은 홍길동 입니다.

In [ ]:
def 함수명(변수):
    실행부분
    return 결과

In [12]:
def calcur(a,b):
    result = a**b
    return result
test = calcur(10,3)
print(test)

1000

In [16]:
import pandas as pd

sample_1 = pd.read_excel('./dataset/sample_1.xlsx',
                         header = 1, # 1번째를 header로 사용하겠다
                         skipfooter = 2, # 마지막 로우에서 2 줄은 생략하겠습니다.
                         usecols ='A:C') # 엑셀 상에서 a:c 칼럼까지만 불러옵니다.

In [17]:
sample_1

  국적코드  성별    입국객수
0  A01  남성  106320
1  A01  여성  191436
2  A31  남성     319
3  A31  여성      42
4  A18  남성  158912
5  A18  여성  232943

In [18]:
sample_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   국적코드    6 non-null      object
 1   성별      6 non-null      object
 2   입국객수    6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [19]:
sample_1.describe()

                입국객수
count       6.000000
mean   114995.333333
std     98105.752006
min        42.000000
25%     26819.250000
50%    132616.000000
75%    183305.000000
max    232943.000000

In [21]:
sample_1[['국적코드', '입국객수']]

  국적코드    입국객수
0  A01  106320
1  A01  191436
2  A31     319
3  A31      42
4  A18  158912
5  A18  232943

In [22]:
sample_1['기준년월']='2019-11'

In [23]:
sample_1

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
1  A01  여성  191436  2019-11
2  A31  남성     319  2019-11
3  A31  여성      42  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

In [24]:
condition = (sample_1['성별']=='남성')
condition

0     True
1    False
2     True
3    False
4     True
5    False
Name: 성별, dtype: bool

In [26]:
sample_1[condition]

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
2  A31  남성     319  2019-11
4  A18  남성  158912  2019-11

In [28]:
sample_1[sample_1['성별']=='남성']

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
2  A31  남성     319  2019-11
4  A18  남성  158912  2019-11

In [29]:
condition = (sample_1['입국객수']>=150000)
sample_1[condition]

  국적코드  성별    입국객수     기준년월
1  A01  여성  191436  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

In [30]:
condition =(sample_1['성별']=='남성')&(sample_1['입국객수']>=150000)
sample_1[condition]

  국적코드  성별    입국객수     기준년월
4  A18  남성  158912  2019-11

In [31]:
condition = (sample_1['국적코드']=='A01')|(sample_1['국적코드']=='A18')
sample_1[condition]

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
1  A01  여성  191436  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

In [ ]:
포함되는 값을 가져오고 싶을 때

In [33]:
condition = (sample_1['국적코드'].isin(['A01', 'A18']))
condition

0     True
1     True
2    False
3    False
4     True
5     True
Name: 국적코드, dtype: bool

In [35]:
sample_1[condition]

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
1  A01  여성  191436  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

In [ ]:
해당 값을 포함하고 싶지 않다면

In [37]:
condition = (sample_1['국적코드'].isin(['A01', 'A18']))
sample_1[condition==False]

  국적코드  성별  입국객수     기준년월
2  A31  남성   319  2019-11
3  A31  여성    42  2019-11

In [38]:
code_master = pd.read_excel('./dataset/sample_codemaster.xlsx')
code_master

  국적코드     국적명
0  A01      일본
1  A02      대만
2  A03      홍콩
3  A18      중국
4  A19      이란
5  A22  우즈베키스탄
6  A23   카자흐스탄
7  A99  아시아 기타

In [ ]:
옆으로 통합하기

In [40]:
sample_1_code = pd.merge(left = sample_1,
                          right = code_master,
                          how = 'left', # 왼쪽로우에 맞춰 결합
                          left_on = '국적코드', # 왼쪽 테이블의 기준 칼럼
                          right_on = '국적코드') # 오른쪽 테이블의 기준 칼럼
sample_1_code

  국적코드  성별    입국객수     기준년월  국적명
0  A01  남성  106320  2019-11   일본
1  A01  여성  191436  2019-11   일본
2  A31  남성     319  2019-11  NaN
3  A31  여성      42  2019-11  NaN
4  A18  남성  158912  2019-11   중국
5  A18  여성  232943  2019-11   중국

In [ ]:
두 데이터 프레임의 공통인 것만 통합하고 싶을 때

In [42]:
sample_1_code_inner = pd.merge(left = sample_1,
                              right = code_master,
                              how = 'inner',
                              left_on= '국적코드',
                              right_on = '국적코드')
sample_1_code_inner

  국적코드  성별    입국객수     기준년월 국적명
0  A01  남성  106320  2019-11  일본
1  A01  여성  191436  2019-11  일본
2  A18  남성  158912  2019-11  중국
3  A18  여성  232943  2019-11  중국

In [ ]:
아래로 통합하기

In [44]:
sample_2 = pd.read_excel('./dataset/sample_2.xlsx',
                         header = 1,
                         skipfooter = 2,
                         usecols='A:C')
sample_2['기준년월'] = '2019-12'
sample_2

  국적코드  성별    입국객수     기준년월
0  A01  남성   92556  2019-12
1  A01  여성  163737  2019-12
2  A18  남성  155540  2019-12
3  A18  여성  249023  2019-12

In [46]:
sample_2_code = pd.merge(left = sample_2,
                         right = code_master,
                         how = 'left',
                         left_on = '국적코드',
                         right_on = '국적코드')
sample_2_code

  국적코드  성별    입국객수     기준년월 국적명
0  A01  남성   92556  2019-12  일본
1  A01  여성  163737  2019-12  일본
2  A18  남성  155540  2019-12  중국
3  A18  여성  249023  2019-12  중국

In [47]:
sample_1_code

  국적코드  성별    입국객수     기준년월  국적명
0  A01  남성  106320  2019-11   일본
1  A01  여성  191436  2019-11   일본
2  A31  남성     319  2019-11  NaN
3  A31  여성      42  2019-11  NaN
4  A18  남성  158912  2019-11   중국
5  A18  여성  232943  2019-11   중국

In [48]:
sample = sample_1_code.append(sample_2_code, ignore_index = True) #1->2
sample

  국적코드  성별    입국객수     기준년월  국적명
0  A01  남성  106320  2019-11   일본
1  A01  여성  191436  2019-11   일본
2  A31  남성     319  2019-11  NaN
3  A31  여성      42  2019-11  NaN
4  A18  남성  158912  2019-11   중국
5  A18  여성  232943  2019-11   중국
6  A01  남성   92556  2019-12   일본
7  A01  여성  163737  2019-12   일본
8  A18  남성  155540  2019-12   중국
9  A18  여성  249023  2019-12   중국

In [50]:
sample_2_code.append(sample_1_code, ignore_index = True) #2->1

  국적코드  성별    입국객수     기준년월  국적명
0  A01  남성   92556  2019-12   일본
1  A01  여성  163737  2019-12   일본
2  A18  남성  155540  2019-12   중국
3  A18  여성  249023  2019-12   중국
4  A01  남성  106320  2019-11   일본
5  A01  여성  191436  2019-11   일본
6  A31  남성     319  2019-11  NaN
7  A31  여성      42  2019-11  NaN
8  A18  남성  158912  2019-11   중국
9  A18  여성  232943  2019-11   중국

In [54]:
sample = pd.concat([sample_1_code, sample_2_code], ignore_index=True) # row로 합칠 경우 axis 언급 없이, column로 합칠 경우 axis=1
sample

  국적코드  성별    입국객수     기준년월  국적명
0  A01  남성  106320  2019-11   일본
1  A01  여성  191436  2019-11   일본
2  A31  남성     319  2019-11  NaN
3  A31  여성      42  2019-11  NaN
4  A18  남성  158912  2019-11   중국
5  A18  여성  232943  2019-11   중국
6  A01  남성   92556  2019-12   일본
7  A01  여성  163737  2019-12   일본
8  A18  남성  155540  2019-12   중국
9  A18  여성  249023  2019-12   중국

In [55]:
sample.to_excel('./dataset/sample.xlsx', index=False)

In [57]:
sample_pivot = sample.pivot_table(values = '입국객수',
                                  index = '국적명',
                                  columns = '기준년월', 
                                  aggfunc = 'mean')
sample_pivot

기준년월   2019-11   2019-12
국적명
일본    148878.0  128146.5
중국    195927.5  202281.5

In [ ]:
aggfunc 옵션
mean
sum
min
median
max
count
nunique

In [60]:
sample_pivot_2 = sample.pivot_table(values='입국객수',
                                   index = '국적명',
                                   aggfunc = 'max')
sample_pivot_2

       입국객수
국적명
일본   191436
중국   249023